TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_asysctl.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the PARITY_TEST register
//
//*************************************************************************************************
#define ASYSCTL_PARITY_TEST_TESTEN_S   0U
#define ASYSCTL_PARITY_TEST_TESTEN_M   0xFU   // Parity test enable configuration


//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOCFRCGB register
//
//*************************************************************************************************
#define ASYSCTL_ADCSOCFRCGB_SOC0    0x1U          // Generate synchronous SW trigger for SOC0
#define ASYSCTL_ADCSOCFRCGB_SOC1    0x2U          // Generate synchronous SW trigger for SOC1
#define ASYSCTL_ADCSOCFRCGB_SOC2    0x4U          // Generate synchronous SW trigger for SOC2
#define ASYSCTL_ADCSOCFRCGB_SOC3    0x8U          // Generate synchronous SW trigger for SOC3
#define ASYSCTL_ADCSOCFRCGB_SOC4    0x10U         // Generate synchronous SW trigger for SOC4
#define ASYSCTL_ADCSOCFRCGB_SOC5    0x20U         // Generate synchronous SW trigger for SOC5
#define ASYSCTL_ADCSOCFRCGB_SOC6    0x40U         // Generate synchronous SW trigger for SOC6
#define ASYSCTL_ADCSOCFRCGB_SOC7    0x80U         // Generate synchronous SW trigger for SOC7
#define ASYSCTL_ADCSOCFRCGB_SOC8    0x100U        // Generate synchronous SW trigger for SOC8
#define ASYSCTL_ADCSOCFRCGB_SOC9    0x200U        // Generate synchronous SW trigger for SOC9
#define ASYSCTL_ADCSOCFRCGB_SOC10   0x400U        // Generate synchronous SW trigger for SOC10
#define ASYSCTL_ADCSOCFRCGB_SOC11   0x800U        // Generate synchronous SW trigger for SOC11
#define ASYSCTL_ADCSOCFRCGB_SOC12   0x1000U       // Generate synchronous SW trigger for SOC12
#define ASYSCTL_ADCSOCFRCGB_SOC13   0x2000U       // Generate synchronous SW trigger for SOC13
#define ASYSCTL_ADCSOCFRCGB_SOC14   0x4000U       // Generate synchronous SW trigger for SOC14
#define ASYSCTL_ADCSOCFRCGB_SOC15   0x8000U       // Generate synchronous SW trigger for SOC15
#define ASYSCTL_ADCSOCFRCGB_SOC16   0x10000U      // Generate synchronous SW trigger for SOC16
#define ASYSCTL_ADCSOCFRCGB_SOC17   0x20000U      // Generate synchronous SW trigger for SOC17
#define ASYSCTL_ADCSOCFRCGB_SOC18   0x40000U      // Generate synchronous SW trigger for SOC18
#define ASYSCTL_ADCSOCFRCGB_SOC19   0x80000U      // Generate synchronous SW trigger for SOC19
#define ASYSCTL_ADCSOCFRCGB_SOC20   0x100000U     // Generate synchronous SW trigger for SOC20
#define ASYSCTL_ADCSOCFRCGB_SOC21   0x200000U     // Generate synchronous SW trigger for SOC21
#define ASYSCTL_ADCSOCFRCGB_SOC22   0x400000U     // Generate synchronous SW trigger for SOC22
#define ASYSCTL_ADCSOCFRCGB_SOC23   0x800000U     // Generate synchronous SW trigger for SOC23
#define ASYSCTL_ADCSOCFRCGB_SOC24   0x1000000U    // Generate synchronous SW trigger for SOC24
#define ASYSCTL_ADCSOCFRCGB_SOC25   0x2000000U    // Generate synchronous SW trigger for SOC25
#define ASYSCTL_ADCSOCFRCGB_SOC26   0x4000000U    // Generate synchronous SW trigger for SOC26
#define ASYSCTL_ADCSOCFRCGB_SOC27   0x8000000U    // Generate synchronous SW trigger for SOC27
#define ASYSCTL_ADCSOCFRCGB_SOC28   0x10000000U   // Generate synchronous SW trigger for SOC28
#define ASYSCTL_ADCSOCFRCGB_SOC29   0x20000000U   // Generate synchronous SW trigger for SOC29
#define ASYSCTL_ADCSOCFRCGB_SOC30   0x40000000U   // Generate synchronous SW trigger for SOC30
#define ASYSCTL_ADCSOCFRCGB_SOC31   0x80000000U   // Generate synchronous SW trigger for SOC31

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOCFRCGBSEL register
//
//*************************************************************************************************
#define ASYSCTL_ADCSOCFRCGBSEL_ADCA   0x1U    // Generate synchronous SW trigger for ADCA
#define ASYSCTL_ADCSOCFRCGBSEL_ADCB   0x2U    // Generate synchronous SW trigger for ADCB
#define ASYSCTL_ADCSOCFRCGBSEL_ADCC   0x4U    // Generate synchronous SW trigger for ADCC
#define ASYSCTL_ADCSOCFRCGBSEL_ADCD   0x8U    // Generate synchronous SW trigger for ADCD
#define ASYSCTL_ADCSOCFRCGBSEL_ADCE   0x10U   // Generate synchronous SW trigger for ADCE

//*************************************************************************************************
//
// The following are defines for the bit fields in the PARITY_TEST_ALT1 register
//
//*************************************************************************************************
#define ASYSCTL_PARITY_TEST_ALT1_TESTEN_S   0U
#define ASYSCTL_PARITY_TEST_ALT1_TESTEN_M   0xFU   // Parity test enable configuration



#endif
